tap "fmenezes/tap"
tap "homebrew/bundle"
tap "osx-cross/avr"
tap "teamookla/speedtest"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# Ultralightweight JSON parser in ANSI C
brew "cjson"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# JSON parser for C
brew "json-c"
# Library for interacting with JSON
brew "jsoncpp"
# Configuration file processing library
brew "libconfig"
# Core utilities for Python packages
brew "python-packaging"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# Manage compile and link flags for libraries
brew "pkg-config"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display and control your Android device
brew "scrcpy"
# Fuzzy Finder in rust!
brew "sk"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Tree command, improved
brew "tre-command"
# C macros for hash tables and more
brew "uthash"
# Internet file retriever
brew "wget"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Web browser
cask "firefox"
# Free and open-source image editor
cask "gimp"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# RAW photo processor
cask "rawtherapee"
# Screenshot measurement and annotation tool
cask "shottr"
# PDF reader and note-taking application
cask "skim"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Customizable email client
cask "thunderbird"
# Open-source code editor
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "asciidoctor.asciidoctor-vscode"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.docs-view"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "editorconfig.editorconfig"
vscode "github.github-vscode-theme"
vscode "gruntfuggly.todo-tree"
vscode "henrytsz.nvim"
vscode "james-yu.latex-workshop"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "pkief.material-icon-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
